y3s2/cs5250/cs5250.org
#+TITLE: Cs5250

* Week 6:
** System calls
Two ways to enter kernel: =SYSCALL/SYSENTER= or an interrupt
*** How to do system calls?
- Model Specific Registers (MSR) in x86 allows configuration of OS-specific
  things like =sysenter/exit=
  + =rdmsr, wrmsr= instructions used to move data from(to) =MSR[ECX]= to(from) =EDX:EAX=
  + Existence can be confirmed through the =cpuid= instruction
**** SYSCALL/SYSENTER instruction and security
- was implemented as an interrupt =int 0x80=, now using
  =SYSENTER/SYSEXIT/SYSCALL= instruction
- having an instruction prevents attacker from calling it before their code (can
  only be called by kernel)
**** Difference between SYSENTER and interrupt
Interrupts can happen even at ring 0, however SYSENTER is used to transit from
other rings to 0
*** Stacks
**** Kernel stack
- Every thread has one
- Stored in =task_struct=
- Grows toward the =thread_info= structure
**** Intel's hardware support for stacks: Task State Segment
https://wiki.osdev.org/Task_State_Segment
*** Page Table Isolation
- Full set of kernel page tables used to coexist with user page tables, presents
  a security loophole
- Now each process's virtual memory space only save partial kernel PT
*** What happens when we do a syscall?
More info: =arch/x86/entry/entry_64.s:entry_SYSCALL_64=
1. save the current stack location and load the full kernel stack (pointed to by
   =CR3=)
2. Uses assembly to construct the =pt_regs= struct, which stores registers
   needed by =syscall=
3. Calls the service dispatcher (call the correct syscall given the sycall
   number), in =arch/x86/entry/common.c:do_syscall_64()=
*** How to speed up syscalls?
**** Old idea: call them in userspace
- some system calls (eg. read, write) are called very often. How do we speed up?
- Answer: execute *read-only* syscalls in userspace, eg. =gettimeofday()=,
  =time()=, =getcpu()= etc
**** New idea: virtual dynamic shared object (vDSO) + Address Space Randomization (ASR)
- Still allows system calls (whose object file is mapped in userspace) in user space
- However there is Address Space Randomization (ASR) to change the address of
  this vDSO, so attacker will not know where it is.
** Interrupts
Motivating question: how to get input from devices?
1. Poll from each device regularly
   Waste resources
2. Use interrupts - devices take the lead
*** When are interrupts checked?
- At EVERY pipeline round, Fetch - Decode - Execute - Check for Interrupts,
  Fetch etc
- If there is an interrupt:
  1. Save context
  2. Get interrupt number
  3. Execute and clean up Instruction Service Routine (ISR)
*** Two types of interrupts
**** Classification 1
***** Async
Not related to current instruction - from external sources such as mouse click.
***** Synchronous (aka exceptions)
1. Faults (eg page faults)
   It is retried. Intel since Pentium 4 has a =replay queue= to retry
   instructions in case of fault.
2. Traps, Not retried.
   - Eg. debuggers like gdb stop at a certain breakpoint.
     This is done by injecting the =INT 3 (0xCC)= one-byte instruction at the
     instruction location where you want to stop. CPU will hit this one-byte
     instruction and the parent debugger process will gain control.
3. Abort
   Hardware failure
4. Programmed, eg syscalls
**** Classification 2
***** I/O interrupts
****** Critical
****** Non-Critical
****** Non-Critical Deferrable
***** Timer
***** Interprocessor
*** Hardware to cause interrupts
**** History: Intel 8259 Programmable Interrupt Controller (PIC)
- A hardware chip that has multiple physical pins.
- When the pins receive signals (by ethernet, whatever), it sends interrupts to
  the CPU
- Every interrupt has a mask (an interrupt is masked if CPU does not want to
  service this interrupt) and a priority.
**** Extension: Advanced PIC (APIC)
- PIC can only service interrupts per-CPU. For multithreaded systems, APIC can
  service inter-CPU interrupts.
**** Interrupt vectors (Intel)
- Each interrupt is mapped to a number (called vectors) in software.
- Interrupt vector =32= and above are masked. Vector =2= is non-maskable
  interrupt (NMI), which is the *hardware reset button*.
- Which pin maps to which vectore is entirely programmable (by the hardware designer)
**** Assigning IRQs to Devices
- PCI assigns at boot
- Usually vector = IRQ + 32
- The mapping is saved at the Interrupt Descriptor Table. Location is indicated
  by the IDTR (IDT Register).
*** How are interrupts handled by x86?
**** Interrupt Descriptor Table Registor (IDTR)
- Points to a table (IDT) consisting of either
  1. Task-gate descriptor
  2. Interrupt-gate descriptor
     No more execute
  3. Trap-gate descriptor
     Can still execute
**** Interrupts and stacks
- Interrupts are handled in the kernel, thus there is a switch of stack from
  higher to lower ring.
- If a ring change happens, the stack switches to that pointed to the current
  task's Task State Segment (TSS), storing info for all registers.
**** Things that can happen during interrupt
***** Double Fault
The exception-handling code induces another exception. Panics and dies.
***** Nested interrupt
Not to be confused with above - While handling eg. mouse interrupt, a mic
interrupt comes, and while handling mic interrupt, another interrupt comes etc...
- This happens on a CPU. We can mask all other interrupts while handling one,
  but it is not preferrable.
- We can utilize other cores.
- To handle an interrupt, we check if it is nested by checking whether the
  privilege level is changed. If it is nested, ring 0 -> ring 0 then no change.
*** How does OS handle interrupts?
**** Overall strategy
Splits the handling into *top* and *bottom* half.
***** Top half
bare minimum needed, save register, unmask etc. Very fast to return
**** Bottom half
***** Software IRQ (ksoftirq)
- Interrupt Queue as a software
- Each processor runs a daemon, =ksoftirqd= which infinitely polls for softIRQs
  to service.
- softIRQ is re-entrant, means can be re-executed as needed
***** Tasklet
- Can be statically/dynamically allocated, whereas softIRQ is fixed
- Is non-re-entrant.
***** Work queue
***** Kernel Thread
** Signals
*** POSIX Signals
- 1990 and 2001, like =SIGINT, SIGKILL, SIGTERM= etc
- Sent using syscall (to others) =kill=, or to self using =raise=
