y3s2/cs5250/cs5250.tex
% Created 2021-05-05 Wed 15:25
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsthm}
\usepackage{minted}
\author{Tan Yee Jian}
\date{\today}
\title{Cs5250}
\hypersetup{
 pdfauthor={Tan Yee Jian},
 pdftitle={Cs5250},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Week 6:}
\label{sec:org45f5a91}
\subsection{System calls}
\label{sec:org875a619}
Two ways to enter kernel: \texttt{SYSCALL/SYSENTER} or an interrupt
\subsubsection{How to do system calls?}
\label{sec:org533d333}
\begin{itemize}
\item Model Specific Registers (MSR) in x86 allows configuration of OS-specific
things like \texttt{sysenter/exit}
\begin{itemize}
\item \texttt{rdmsr, wrmsr} instructions used to move data from(to) \texttt{MSR[ECX]} to(from) \texttt{EDX:EAX}
\item Existence can be confirmed through the \texttt{cpuid} instruction
\end{itemize}
\end{itemize}
\begin{enumerate}
\item SYSCALL/SYSENTER instruction and security
\label{sec:orge44bf73}
\begin{itemize}
\item was implemented as an interrupt \texttt{int 0x80}, now using
\texttt{SYSENTER/SYSEXIT/SYSCALL} instruction
\item having an instruction prevents attacker from calling it before their code (can
only be called by kernel)
\end{itemize}
\item Difference between SYSENTER and interrupt
\label{sec:org743bd28}
Interrupts can happen even at ring 0, however SYSENTER is used to transit from
other rings to 0
\end{enumerate}
\subsubsection{Stacks}
\label{sec:org84ecd9d}
\begin{enumerate}
\item Kernel stack
\label{sec:org59b3f2f}
\begin{itemize}
\item Every thread has one
\item Stored in \texttt{task\_struct}
\item Grows toward the \texttt{thread\_info} structure
\end{itemize}
\item Intel's hardware support for stacks: Task State Segment
\label{sec:org966b933}
\url{https://wiki.osdev.org/Task\_State\_Segment}
\end{enumerate}
\subsubsection{Page Table Isolation}
\label{sec:orgad46452}
\begin{itemize}
\item Full set of kernel page tables used to coexist with user page tables, presents
a security loophole
\item Now each process's virtual memory space only save partial kernel PT
\end{itemize}
\subsubsection{What happens when we do a syscall?}
\label{sec:orgbad6e10}
More info: \texttt{arch/x86/entry/entry\_64.s:entry\_SYSCALL\_64}
\begin{enumerate}
\item save the current stack location and load the full kernel stack (pointed to by
\texttt{CR3})
\item Uses assembly to construct the \texttt{pt\_regs} struct, which stores registers
needed by \texttt{syscall}
\item Calls the service dispatcher (call the correct syscall given the sycall
number), in \texttt{arch/x86/entry/common.c:do\_syscall\_64()}
\end{enumerate}
\subsubsection{How to speed up syscalls?}
\label{sec:orgf1642fc}
\begin{enumerate}
\item Old idea: call them in userspace
\label{sec:orgb836ded}
\begin{itemize}
\item some system calls (eg. read, write) are called very often. How do we speed up?
\item Answer: execute \textbf{read-only} syscalls in userspace, eg. \texttt{gettimeofday()},
\texttt{time()}, \texttt{getcpu()} etc
\end{itemize}
\item New idea: virtual dynamic shared object (vDSO) + Address Space Randomization (ASR)
\label{sec:orged6323b}
\begin{itemize}
\item Still allows system calls (whose object file is mapped in userspace) in user space
\item However there is Address Space Randomization (ASR) to change the address of
this vDSO, so attacker will not know where it is.
\end{itemize}
\end{enumerate}
\subsection{Interrupts}
\label{sec:org5d50020}
Motivating question: how to get input from devices?
\begin{enumerate}
\item Poll from each device regularly
Waste resources
\item Use interrupts - devices take the lead
\end{enumerate}
\subsubsection{When are interrupts checked?}
\label{sec:org45089c0}
\begin{itemize}
\item At EVERY pipeline round, Fetch - Decode - Execute - Check for Interrupts,
Fetch etc
\item If there is an interrupt:
\begin{enumerate}
\item Save context
\item Get interrupt number
\item Execute and clean up Instruction Service Routine (ISR)
\end{enumerate}
\end{itemize}
\subsubsection{Two types of interrupts}
\label{sec:org54b37e4}
\begin{enumerate}
\item Classification 1
\label{sec:orga731c2b}
\begin{enumerate}
\item Async
\label{sec:orgeeba96f}
Not related to current instruction - from external sources such as mouse click.
\item Synchronous (aka exceptions)
\label{sec:org7b1fbbc}
\begin{enumerate}
\item Faults (eg page faults)
It is retried. Intel since Pentium 4 has a \texttt{replay queue} to retry
instructions in case of fault.
\item Traps, Not retried.
\begin{itemize}
\item Eg. debuggers like gdb stop at a certain breakpoint.
This is done by injecting the \texttt{INT 3 (0xCC)} one-byte instruction at the
instruction location where you want to stop. CPU will hit this one-byte
instruction and the parent debugger process will gain control.
\end{itemize}
\item Abort
Hardware failure
\item Programmed, eg syscalls
\end{enumerate}
\end{enumerate}
\item Classification 2
\label{sec:org5c7e976}
\begin{enumerate}
\item I/O interrupts
\label{sec:org42cd3cb}
\begin{enumerate}
\item Critical
\label{sec:orgf7c3268}
\item Non-Critical
\label{sec:orgc2864c1}
\item Non-Critical Deferrable
\label{sec:org337a3e1}
\end{enumerate}
\item Timer
\label{sec:orgcdaa577}
\item Interprocessor
\label{sec:org1b3449e}
\end{enumerate}
\end{enumerate}
\subsubsection{Hardware to cause interrupts}
\label{sec:orga377372}
\begin{enumerate}
\item History: Intel 8259 Programmable Interrupt Controller (PIC)
\label{sec:orgd08e02b}
\begin{itemize}
\item A hardware chip that has multiple physical pins.
\item When the pins receive signals (by ethernet, whatever), it sends interrupts to
the CPU
\item Every interrupt has a mask (an interrupt is masked if CPU does not want to
service this interrupt) and a priority.
\end{itemize}
\item Extension: Advanced PIC (APIC)
\label{sec:orgc401bae}
\begin{itemize}
\item PIC can only service interrupts per-CPU. For multithreaded systems, APIC can
service inter-CPU interrupts.
\end{itemize}
\item Interrupt vectors (Intel)
\label{sec:org373647f}
\begin{itemize}
\item Each interrupt is mapped to a number (called vectors) in software.
\item Interrupt vector \texttt{32} and above are masked. Vector \texttt{2} is non-maskable
interrupt (NMI), which is the \textbf{hardware reset button}.
\item Which pin maps to which vectore is entirely programmable (by the hardware designer)
\end{itemize}
\item Assigning IRQs to Devices
\label{sec:org20b0803}
\begin{itemize}
\item PCI assigns at boot
\item Usually vector = IRQ + 32
\item The mapping is saved at the Interrupt Descriptor Table. Location is indicated
by the IDTR (IDT Register).
\end{itemize}
\end{enumerate}
\subsubsection{How are interrupts handled by x86?}
\label{sec:orgd265134}
\begin{enumerate}
\item Interrupt Descriptor Table Registor (IDTR)
\label{sec:orgb4f840b}
\begin{itemize}
\item Points to a table (IDT) consisting of either
\begin{enumerate}
\item Task-gate descriptor
\item Interrupt-gate descriptor
No more execute
\item Trap-gate descriptor
Can still execute
\end{enumerate}
\end{itemize}
\item Interrupts and stacks
\label{sec:org7f5709a}
\begin{itemize}
\item Interrupts are handled in the kernel, thus there is a switch of stack from
higher to lower ring.
\item If a ring change happens, the stack switches to that pointed to the current
task's Task State Segment (TSS), storing info for all registers.
\end{itemize}
\item Things that can happen during interrupt
\label{sec:org9b6c5ed}
\begin{enumerate}
\item Double Fault
\label{sec:org3f43c6f}
The exception-handling code induces another exception. Panics and dies.
\item Nested interrupt
\label{sec:org5a810c8}
Not to be confused with above - While handling eg. mouse interrupt, a mic
interrupt comes, and while handling mic interrupt, another interrupt comes etc\ldots{}
\begin{itemize}
\item This happens on a CPU. We can mask all other interrupts while handling one,
but it is not preferrable.
\item We can utilize other cores.
\item To handle an interrupt, we check if it is nested by checking whether the
privilege level is changed. If it is nested, ring 0 -> ring 0 then no change.
\end{itemize}
\end{enumerate}
\end{enumerate}
\subsubsection{How does OS handle interrupts?}
\label{sec:orgcfaa57a}
\begin{enumerate}
\item Overall strategy
\label{sec:orgb026f7a}
Splits the handling into \textbf{top} and \textbf{bottom} half.
\begin{enumerate}
\item Top half
\label{sec:org4a317d4}
bare minimum needed, save register, unmask etc. Very fast to return
\end{enumerate}
\item Bottom half
\label{sec:orgeef5d03}
\begin{enumerate}
\item Software IRQ (ksoftirq)
\label{sec:orga5fb464}
\begin{itemize}
\item Interrupt Queue as a software
\item Each processor runs a daemon, \texttt{ksoftirqd} which infinitely polls for softIRQs
to service.
\item softIRQ is re-entrant, means can be re-executed as needed
\end{itemize}
\item Tasklet
\label{sec:orgaa36fa9}
\begin{itemize}
\item Can be statically/dynamically allocated, whereas softIRQ is fixed
\item Is non-re-entrant.
\end{itemize}
\item Work queue
\label{sec:org40f3a7a}
\item Kernel Thread
\label{sec:org7094734}
\end{enumerate}
\end{enumerate}
\subsection{Signals}
\label{sec:org7105543}
\subsubsection{POSIX Signals}
\label{sec:org78686e9}
\begin{itemize}
\item 1990 and 2001, like \texttt{SIGINT, SIGKILL, SIGTERM} etc
\item Sent using syscall (to others) \texttt{kill}, or to self using \texttt{raise}
\end{itemize}
