y3s2/cs5250/cs5250.org
*** Data structures for signal handling
- =task_struct= is the process descriptor, saves signal handlers
*** Handling flow
- Check slides 78 of Chapter 6
- Kernel points the instruction pointer (RIP) to the signal handler, as well as
  back up the stack
* Lecture 8: Memory
** The memory hierachy
|             | L1 Cache    | L2 Cache     | Main Memory | Secondary Memory |
|-------------+-------------+--------------+-------------+------------------|
| clock cycle | a few       | tens         | hundreds    | millions         |
| size        | word (4-8B) | block(8-32B) | 1-4blocks   | very huge        |
** Principle of Caching: Locality
- Temporal locality: repeatedly use the same data
- Spatial locality: use nearby data
** Virtual vs Physical addressing
- Every process has illusion that it owns all $2^{64}$ bits of memory in its
  virtual memory
  + What if runs out of a certain limit? Out-Of-Memory (OOM) error
- Supports "Modern OS Features":
  - Protection: don't use other process's memory
  - Translation: "use disk swap"
  - Sharing: Map multiple virtual pages to a sams physical page
** Address Translation
- Given page size = 4k, we have offset = 12 bits (2^12=4k)
- Address = virtual page # + offset
  + Virtual page # leads to an entry in page table, with
    1. A valid bit
    2. A next level virtual page #
- Page fault: page is not in main memory
*** Caching address traslation
+ Problem with caching:
  - Cache that contains memory (physical page) is only relevant only when
    address is *translated* which is expensive
  - Enter *TLB*, which caches virtual address translation
    + Smaller, 128-256 entries max
** Paging in Linux x86
- 4KB a page
- =PG= bit in register =CR0= toggles paging
- Root page table given by (40bits) "page directory base register" in =CR3=
*** x86-64 paging
- only *48* bits are used. 48 = 9 + 9 + 9 + 9 + 12
-
    | Page Level | Name          |
    |------------+---------------|
    |          4 | PLM4          |
    |          3 | Directory Ptr |
    |          2 | Directory     |
    |          1 | Table         |
- Each process has its own CR3 hence root page table value.
- Run through:
  1. Get CR3 hence RPT address.
  2. RPT + first 9 bits = addr of Level 2 page table.
  3. Addr from 2 + next 9 bits = addr of Level 3 Page table.
**** The CR3 Register
| 63:M     | M-12     | 11:0 |
|----------+----------+------|
| reserved | RPT addr | PCID |
**** Reserve bits must be sign-extended
IE if the most significant (non-reserved) bit is 1, then the reserved is 1 and vv.
**** Process Context ID = Address Space ID
- ASID is different across processes (even though RPT might b the same)
*** Linux memory map
- If the 48th bit is 0 -> user space
- Otherwise -> kernel space (half the Virtual Address Space)
- Note that all are sign-extended
*** Master Kernel Page Table
- Every process has own page table
- Of which contains the same MKPT
- MKPT maps the whole physical memory, unlike user process
*** TLB
- Q: When is it flushed?
  A: Always by kernel. For eg when CR3 is changed
*** Page Table Isolation (previously KAISER)
Only kernel process has the full kernel page table.
User process has only enough kernel page table to enter kernel mode (to prevent attacks).
*** Virtual Memory Area (=vm_area_struct=)
Stores the stack, heap, data, bss segments
**** Lazy expansion
1. =brk()= requests for more pages when you run out of memory (eg. via
   repeatedly calling =malloc= until oom)
2. New *virtual* pages are allocated. But not linked to physical pages.
3. UNTIL new virtual pages are used by eg. malloc.
*** Physical Memory Zone
**** Direct Memory Access
Write directly into memory of drivers, disk etc
***** Modes
** Memory Allocator
*** Physical memory allocator (buddy allocator)
Eg. buddy system.
**** Buddy System
Ask for k page frames. Upgrade to the nearest 2^n power. If there is such a
frame, give it. Otherwise, go up one level to 2^(n+1), give it half, and put
half below.
**** API
- =kmalloc()= for physical
  + Either =GFP_ATOMIC= (not allowed to sleep, crucial)
  + or =GFP_KERNEL=
- =vmalloc= for virtual. kernel's =malloc()=
*** Virtual memory allocator (object allocator)
**** Simple List of Blocks (SLOB)
- A kernel object is like the project we did in 2106, contains some bookeeping
  data (pointing to the next free frame), some payload etc
- SLOB uses first-fit, optimized (?) by best-fit
**** SLAB
- A slab is a few contiguous pages.
- Objects are aligned in to the size of cache lines.
** Page Fault
*** Page Fault or SIGSEGV?
- If the address trying to access is in the process address space:
  | Have rights to access? | Result                |
  |------------------------+-----------------------|
  | Yes                    | Access, or Page fault |
  | No                     | SIGSEGV               |
- Otherwise (wrong address space)
  | Mode?  | Result                       |
  |--------+------------------------------|
  | User   | SIGSEGV                      |
  | Kernel | Kernel bug, kill the process |
*** The Linux Kernel is not pageable
This is to prevent page fault in page fault handling etc.
*** Process
1. Entry point: =arch/x86/mm/fault.c:do_page_fault()=
2. Captures the linear address causing the fault in =CR2= contro register.
3. Block the process while setting if the fault is big.
4. Run the flowchart on slide page 99
** Reclamation of Page Frame (deallocation of frame)
*** Page Frame Reclamation Algorithm (PFRA)
- essentially removes/evict page frames to the swap to keep RAM free
- must run before all frames are used up (otherwise no more process can run and
  will crash)
- 4 kinds of frame:
  | Type                      | Reclaim action      |
  |---------------------------+---------------------|
  | Unreclaimable             | -                   |
  | Swappable (anonymous)     | evict to swap       |
  | Syncable (mapped to file) | sync with hard disk |
  | Discardable               | just discard        |
*** Reverse mapping
Motivation: given a frame, which page table entries (PTE) point to it?
**** Object-based Reverse Mapping
- Done by two fields:
- =_mapcount= counts the number of PTEs pointing to it. 0-indexed (ie. -1 when
  no one points to it)
- =mapping=:
  | state           | meaning                                                 |
  |-----------------+---------------------------------------------------------|
  | null            | belongs to the swap cache                               |
  | non-null, lsb=1 | anonymous, points to =anon_vma=                         |
  | non-null, lsb=0 | mapped, points to the =address_space= obj in page cache |
***** =anon_vma=
 - A doubly linked list collecting all the pointers to the same frame
***** =address_space=
- Similar as =anon_vma=
*** Page Reclamation Process
