y3s2/cs5250/cs5250.tex
\subsubsection{Data structures for signal handling}
\label{sec:orge49b6e2}
\begin{itemize}
\item \texttt{task\_struct} is the process descriptor, saves signal handlers
\end{itemize}
\subsubsection{Handling flow}
\label{sec:org2870c71}
\begin{itemize}
\item Check slides 78 of Chapter 6
\item Kernel points the instruction pointer (RIP) to the signal handler, as well as
back up the stack
\end{itemize}
\section{Lecture 8: Memory}
\label{sec:org36ff607}
\subsection{The memory hierachy}
\label{sec:org9c4482e}
\begin{center}
\begin{tabular}{lllll}
 & L1 Cache & L2 Cache & Main Memory & Secondary Memory\\
\hline
clock cycle & a few & tens & hundreds & millions\\
size & word (4-8B) & block(8-32B) & 1-4blocks & very huge\\
\end{tabular}
\end{center}
\subsection{Principle of Caching: Locality}
\label{sec:orgc3af8e3}
\begin{itemize}
\item Temporal locality: repeatedly use the same data
\item Spatial locality: use nearby data
\end{itemize}
\subsection{Virtual vs Physical addressing}
\label{sec:org7d7912f}
\begin{itemize}
\item Every process has illusion that it owns all \(2^{64}\) bits of memory in its
virtual memory
\begin{itemize}
\item What if runs out of a certain limit? Out-Of-Memory (OOM) error
\end{itemize}
\item Supports ``Modern OS Features'':
\begin{itemize}
\item Protection: don't use other process's memory
\item Translation: ``use disk swap''
\item Sharing: Map multiple virtual pages to a sams physical page
\end{itemize}
\end{itemize}
\subsection{Address Translation}
\label{sec:orgead3566}
\begin{itemize}
\item Given page size = 4k, we have offset = 12 bits (2\textsuperscript{12}=4k)
\item Address = virtual page \# + offset
\begin{itemize}
\item Virtual page \# leads to an entry in page table, with
\begin{enumerate}
\item A valid bit
\item A next level virtual page \#
\end{enumerate}
\end{itemize}
\item Page fault: page is not in main memory
\end{itemize}
\subsubsection{Caching address traslation}
\label{sec:org565e307}
\begin{itemize}
\item Problem with caching:
\begin{itemize}
\item Cache that contains memory (physical page) is only relevant only when
address is \textbf{translated} which is expensive
\item Enter \textbf{TLB}, which caches virtual address translation
\begin{itemize}
\item Smaller, 128-256 entries max
\end{itemize}
\end{itemize}
\end{itemize}
\subsection{Paging in Linux x86}
\label{sec:orgd043e1b}
\begin{itemize}
\item 4KB a page
\item \texttt{PG} bit in register \texttt{CR0} toggles paging
\item Root page table given by (40bits) ``page directory base register'' in \texttt{CR3}
\end{itemize}
\subsubsection{x86-64 paging}
\label{sec:org1f3caee}
\begin{itemize}
\item only \textbf{48} bits are used. 48 = 9 + 9 + 9 + 9 + 12
\item \begin{center}
\begin{tabular}{rl}
Page Level & Name\\
\hline
4 & PLM4\\
3 & Directory Ptr\\
2 & Directory\\
1 & Table\\
\end{tabular}
\end{center}
\item Each process has its own CR3 hence root page table value.
\item Run through:
\begin{enumerate}
\item Get CR3 hence RPT address.
\item RPT + first 9 bits = addr of Level 2 page table.
\item Addr from 2 + next 9 bits = addr of Level 3 Page table.
\end{enumerate}
\end{itemize}
\begin{enumerate}
\item The CR3 Register
\label{sec:org3936b1d}
\begin{center}
\begin{tabular}{llr}
63:M & M-12 & 11:0\\
\hline
reserved & RPT addr & PCID\\
\end{tabular}
\end{center}
\item Reserve bits must be sign-extended
\label{sec:org2a13412}
IE if the most significant (non-reserved) bit is 1, then the reserved is 1 and vv.
\item Process Context ID = Address Space ID
\label{sec:org74f5b2d}
\begin{itemize}
\item ASID is different across processes (even though RPT might b the same)
\end{itemize}
\end{enumerate}
\subsubsection{Linux memory map}
\label{sec:org72fe617}
\begin{itemize}
\item If the 48th bit is 0 -> user space
\item Otherwise -> kernel space (half the Virtual Address Space)
\item Note that all are sign-extended
\end{itemize}
\subsubsection{Master Kernel Page Table}
\label{sec:org35d546a}
\begin{itemize}
\item Every process has own page table
\item Of which contains the same MKPT
\item MKPT maps the whole physical memory, unlike user process
\end{itemize}
\subsubsection{TLB}
\label{sec:org1b043ec}
\begin{itemize}
\item Q: When is it flushed?
A: Always by kernel. For eg when CR3 is changed
\end{itemize}
\subsubsection{Page Table Isolation (previously KAISER)}
\label{sec:orgf48b64c}
Only kernel process has the full kernel page table.
User process has only enough kernel page table to enter kernel mode (to prevent attacks).
\subsubsection{Virtual Memory Area (\texttt{vm\_area\_struct})}
\label{sec:orga664f87}
Stores the stack, heap, data, bss segments
\begin{enumerate}
\item Lazy expansion
\label{sec:org00885c2}
\begin{enumerate}
\item \texttt{brk()} requests for more pages when you run out of memory (eg. via
repeatedly calling \texttt{malloc} until oom)
\item New \textbf{virtual} pages are allocated. But not linked to physical pages.
\item UNTIL new virtual pages are used by eg. malloc.
\end{enumerate}
\end{enumerate}
\subsubsection{Physical Memory Zone}
\label{sec:orgd543790}
\begin{enumerate}
\item Direct Memory Access
\label{sec:org4d3d9cc}
Write directly into memory of drivers, disk etc
\begin{enumerate}
\item Modes
\label{sec:orgcb70114}
\end{enumerate}
\end{enumerate}
\subsection{Memory Allocator}
\label{sec:org3915196}
\subsubsection{Physical memory allocator (buddy allocator)}
\label{sec:orgee7ef84}
Eg. buddy system.
\begin{enumerate}
\item Buddy System
\label{sec:org62bcaf6}
Ask for k page frames. Upgrade to the nearest 2\textsuperscript{n} power. If there is such a
frame, give it. Otherwise, go up one level to 2\textsuperscript{(n+1)}, give it half, and put
half below.
\item API
\label{sec:orgde3c005}
\begin{itemize}
\item \texttt{kmalloc()} for physical
\begin{itemize}
\item Either \texttt{GFP\_ATOMIC} (not allowed to sleep, crucial)
\item or \texttt{GFP\_KERNEL}
\end{itemize}
\item \texttt{vmalloc} for virtual. kernel's \texttt{malloc()}
\end{itemize}
\end{enumerate}
\subsubsection{Virtual memory allocator (object allocator)}
\label{sec:org0bc6cf8}
\begin{enumerate}
\item Simple List of Blocks (SLOB)
\label{sec:org600c3ff}
\begin{itemize}
\item A kernel object is like the project we did in 2106, contains some bookeeping
data (pointing to the next free frame), some payload etc
\item SLOB uses first-fit, optimized (?) by best-fit
\end{itemize}
\item SLAB
\label{sec:org70f733c}
\begin{itemize}
\item A slab is a few contiguous pages.
\item Objects are aligned in to the size of cache lines.
\end{itemize}
\end{enumerate}
\subsection{Page Fault}
\label{sec:org00b58bc}
\subsubsection{Page Fault or SIGSEGV?}
\label{sec:orgf64b912}
\begin{itemize}
\item If the address trying to access is in the process address space:
\begin{center}
\begin{tabular}{ll}
Have rights to access? & Result\\
\hline
Yes & Access, or Page fault\\
No & SIGSEGV\\
\end{tabular}
\end{center}
\item Otherwise (wrong address space)
\begin{center}
\begin{tabular}{ll}
Mode? & Result\\
\hline
User & SIGSEGV\\
Kernel & Kernel bug, kill the process\\
\end{tabular}
\end{center}
\end{itemize}
\subsubsection{The Linux Kernel is not pageable}
\label{sec:org44deeb9}
This is to prevent page fault in page fault handling etc.
\subsubsection{Process}
\label{sec:org5edb051}
\begin{enumerate}
\item Entry point: \texttt{arch/x86/mm/fault.c:do\_page\_fault()}
\item Captures the linear address causing the fault in \texttt{CR2} contro register.
\item Block the process while setting if the fault is big.
\item Run the flowchart on slide page 99
\end{enumerate}
\subsection{Reclamation of Page Frame (deallocation of frame)}
\label{sec:orgdec4eab}
\subsubsection{Page Frame Reclamation Algorithm (PFRA)}
\label{sec:org0171cca}
\begin{itemize}
\item essentially removes/evict page frames to the swap to keep RAM free
\item must run before all frames are used up (otherwise no more process can run and
will crash)
\item 4 kinds of frame:
\begin{center}
\begin{tabular}{ll}
Type & Reclaim action\\
\hline
Unreclaimable & -\\
Swappable (anonymous) & evict to swap\\
Syncable (mapped to file) & sync with hard disk\\
Discardable & just discard\\
\end{tabular}
\end{center}
\end{itemize}
\subsubsection{Reverse mapping}
\label{sec:orgd52d353}
Motivation: given a frame, which page table entries (PTE) point to it?
\begin{enumerate}
\item Object-based Reverse Mapping
\label{sec:org7272aa9}
\begin{itemize}
\item Done by two fields:
\item \texttt{\_mapcount} counts the number of PTEs pointing to it. 0-indexed (ie. -1 when
no one points to it)
\item \texttt{mapping}:
\begin{center}
\begin{tabular}{ll}
state & meaning\\
\hline
null & belongs to the swap cache\\
non-null, lsb=1 & anonymous, points to \texttt{anon\_vma}\\
non-null, lsb=0 & mapped, points to the \texttt{address\_space} obj in page cache\\
\end{tabular}
\end{center}
\end{itemize}
\begin{enumerate}
\item \texttt{anon\_vma}
\label{sec:org8e5a7b1}
\begin{itemize}
\item A doubly linked list collecting all the pointers to the same frame
\end{itemize}
\item \texttt{address\_space}
\label{sec:org487ae23}
\begin{itemize}
\item Similar as \texttt{anon\_vma}
\end{itemize}
\end{enumerate}
\end{enumerate}
\subsubsection{Page Reclamation Process}
\label{sec:org898d280}
\begin{enumerate}
