y3s2/cs5250/cs5250.org
**** For mapped page frames:
- Two clock lists (Least Recently Used), fixed size, one is the =active= list,
  the other is =inactive= list
- Original algorithm:
  1. If freshly faulted (allocated) you start at the inactive list
  2. If used for the second time, promoted to active list
  3. In active list, membership cannot be refreshed. Once sufficient active
     pages enter the active list, it is demoted to inactive
  4. In inactive long enough then reclaimed, else step (2)
- Some observations
  - eviction: only happens when a new fault is introduced. kicks the head of
    =inactive= list away.
  - activation: second time it is read, promoted from =inactive= to =active=.
  - min # of inactive page access  = eviction + activation.
  - refault distance: R - E where E is the reading of the sum above when it is
    evicted, R is the reading above when it is refaulted back into memory.
    + Intuition: If the list was made R-E longer, it wont be evicted.
  - Minimum access distance: length of inactive + (R-E)
*** Page Cache (for opened files)
- Write-back caching: changes are not written immediately but only marked dirty
  on cache. Periodically, it is written into the disk (when evicted by algorithm)
**** Important fields in =address_space=
***** =page_tree= a radix tree of all pages
- Radix trees represent a map from keys (strings) to values.
- All pages have their memory addresses as keys, pointed to the frames. Every 6
  bits as a unit for branching.
** Swap
- A disk partition (or a file), maximally =MAX_SWAPFILES=32=
- Swap area consists of swap slots, each slot is 4KB.
- Pages can be *swapped in* to swap or *swapped out* into RAM
- Race conditions are resolved using the swap cache
*** Swap Cache
1. Suppose A, B are processes using a same page P.
2. Page P needs to be swapped.
3. Swap cache caches P. It provides a reference in case when swapping in P,
   either process needs to read P.
4. Once done, both A and B point to the swap slot.
* Lecture 9: Synchronization
** Concurrency in the Kernel
- Motivation: SMP OS Kernels are pre-emptible
- True concurrency: due to multiple processors
- Pseudo concurrency: due to interleaving of instructions
  + Software based: voluntary/involuntary preemption (avoidable by disabling
    preemption)
  + Hardware based: interrupt/trap/fault/exception handlers (can be disabled)
** Synchronization techniques in Linux
*** Per-CPU Variables
- Removes the need to synchronize between cores
**** How is this implemented?
- Code, Data, Extra, Stack Segments (CS,DS,ES,SS) have segment base = 0,
  creating a flat address space.
- FS, GS are exceptions.
- =SWAPGS= instruction swaps in correct value of the GS register (kept to 0 in
  user mode) from the MSR
- Which points to an array of pointers, maintaining per-cpu variables
*** Atomic Operations
- Atomic instructions, implemented by the CPU
*** Memory Barriers
- Optimization barrier (user library): =barrier()= to prevent reordering of
  instructions by the compiler
- Memory barrier (instructions): to prevent read-write reordering
*** Spin Locks (Active waiting)
**** API
=spin_lock()= and =spin_unlock()=
**** Ticket Locks
Assumption: there is an atomic =fetch_and_inc(var)= function.
- entering cs: take a ticket number with fetch and inc. Active waiting when is
  not my number
- exiting cs: increment the now_serving with =fetch_and_inc(var)=.

**** Problem with interrupts
- What if an interrupt happens when a process holds the spin lock?
- What if the interrupt handler needs to acess data held by the spin lock holder?
**** Solution: disable interrupts while holding spin lock
*** Semaphore
**** Etymology
Flags used on ships to communicate
**** Difference compared to spin locks
- Contention for the lock causes *blocking* not *spinning*.
- Can allow concurrency of more than 1 process if necessary
**** API
- =down()= or =P()=: can be blocked, although can either down or try_down
- =up()= or =V()=
*** Reader/writer locks
Allows multiple reader or a single writer. Increase efficiency of semaphore
**** Big reader locks (=br_lock=)
Specialized form, very fast to acquire for reading but slow for writing. Think
possible starvation for writer?
*** Seqlock
A reader-writer lock with high priority on writers
**** How it works
1. On top of a spin lock, there is a sequence field
2. The sequence value is incremented when writer uses
3. Readers might need to re-read
*** Read-copy Update (RCU)
- Lock-free data structure
- Another R-W lock. Writes are written to a new copy, and writer changes the
  pointer to the new copy atomically.
- Before reading, some time is given (swap to user space, idle loop) to ensure
  the new copy is pointed to, hence read.
*** Completion
** Lock-free data structures
*** Problem with locks
1. Deadlock
2. Priority inversion
3. Convoying - long thread get the lock, stalling short ones
4. Signal safety
5. Kill-tolerance - what if the holder is killed?
6. Pre-emption tolerance - what if the holder is preempted?
7. Performance - forced sequential operations
*** The heart of lock-free data structures - CAS
... is the =compare_and_swap(*ptr, old_val,  new_val)= atomic operation.
*** An example: lock-free stack
**** Structure
A (singly) linked list, where head is the top of the stack
**** API
***** push
1. create a linked list node with the new value
2. while =compare_and_swap(head, curr_node->next, curr_node)= is false, make the
   new node point to the (new) linked list head
***** pop
**** The ABA Problem
1. Say the stack is A -> B -> X
2. P1 reads A from the stack
3. P2 pops A
4. P2 pops B
5. P2 pushes A
6. P1 comes back and compares with the head, which is still A, but the value is
   changed (they use the same pointer?)
***** Solution
- Keep an update count for each element. That way the new generation will not be
  confused as the previous.
- Uses the doubleword compare and swap (CAS)
*** CAS is Insufficient
Imagine a linked list, P1 tries to delete the 2nd element, P2 tries to insert
between the 2nd and 3rd element. The new list does not the 1st element point to
P2 in one execution (verify this).
* Lecture 10: Filesystem
A bookeeping attempt for the array of bits on hard drive.
** Virtual Filesystem (VFS)
- Known though its APIs: =open, close, read, write= syscalls
- Abstracts through different fs: =ext2, ms-dos= etc
*** Common File Model
- The data structure to represent files
