y3s2/cs5250/cs5250.tex
\item For mapped page frames:
\label{sec:org87859ee}
\begin{itemize}
\item Two clock lists (Least Recently Used), fixed size, one is the \texttt{active} list,
the other is \texttt{inactive} list
\item Original algorithm:
\begin{enumerate}
\item If freshly faulted (allocated) you start at the inactive list
\item If used for the second time, promoted to active list
\item In active list, membership cannot be refreshed. Once sufficient active
pages enter the active list, it is demoted to inactive
\item In inactive long enough then reclaimed, else step (2)
\end{enumerate}
\item Some observations
\begin{itemize}
\item eviction: only happens when a new fault is introduced. kicks the head of
\texttt{inactive} list away.
\item activation: second time it is read, promoted from \texttt{inactive} to \texttt{active}.
\item min \# of inactive page access  = eviction + activation.
\item refault distance: R - E where E is the reading of the sum above when it is
evicted, R is the reading above when it is refaulted back into memory.
\begin{itemize}
\item Intuition: If the list was made R-E longer, it wont be evicted.
\end{itemize}
\item Minimum access distance: length of inactive + (R-E)
\end{itemize}
\end{itemize}
\end{enumerate}
\subsubsection{Page Cache (for opened files)}
\label{sec:org5098570}
\begin{itemize}
\item Write-back caching: changes are not written immediately but only marked dirty
on cache. Periodically, it is written into the disk (when evicted by algorithm)
\end{itemize}
\begin{enumerate}
\item Important fields in \texttt{address\_space}
\label{sec:org6bcdd45}
\begin{enumerate}
\item \texttt{page\_tree} a radix tree of all pages
\label{sec:org17d4ec8}
\begin{itemize}
\item Radix trees represent a map from keys (strings) to values.
\item All pages have their memory addresses as keys, pointed to the frames. Every 6
bits as a unit for branching.
\end{itemize}
\end{enumerate}
\end{enumerate}
\subsection{Swap}
\label{sec:org8eae2a0}
\begin{itemize}
\item A disk partition (or a file), maximally \texttt{MAX\_SWAPFILES=32}
\item Swap area consists of swap slots, each slot is 4KB.
\item Pages can be \textbf{swapped in} to swap or \textbf{swapped out} into RAM
\item Race conditions are resolved using the swap cache
\end{itemize}
\subsubsection{Swap Cache}
\label{sec:org2d243eb}
\begin{enumerate}
\item Suppose A, B are processes using a same page P.
\item Page P needs to be swapped.
\item Swap cache caches P. It provides a reference in case when swapping in P,
either process needs to read P.
\item Once done, both A and B point to the swap slot.
\end{enumerate}
\section{Lecture 9: Synchronization}
\label{sec:org1b6265b}
\subsection{Concurrency in the Kernel}
\label{sec:orge45f899}
\begin{itemize}
\item Motivation: SMP OS Kernels are pre-emptible
\item True concurrency: due to multiple processors
\item Pseudo concurrency: due to interleaving of instructions
\begin{itemize}
\item Software based: voluntary/involuntary preemption (avoidable by disabling
preemption)
\item Hardware based: interrupt/trap/fault/exception handlers (can be disabled)
\end{itemize}
\end{itemize}
\subsection{Synchronization techniques in Linux}
\label{sec:org273aad3}
\subsubsection{Per-CPU Variables}
\label{sec:org59e40b7}
\begin{itemize}
\item Removes the need to synchronize between cores
\end{itemize}
\begin{enumerate}
\item How is this implemented?
\label{sec:orgf7fc9c5}
\begin{itemize}
\item Code, Data, Extra, Stack Segments (CS,DS,ES,SS) have segment base = 0,
creating a flat address space.
\item FS, GS are exceptions.
\item \texttt{SWAPGS} instruction swaps in correct value of the GS register (kept to 0 in
user mode) from the MSR
\item Which points to an array of pointers, maintaining per-cpu variables
\end{itemize}
\end{enumerate}
\subsubsection{Atomic Operations}
\label{sec:orgfb95a59}
\begin{itemize}
\item Atomic instructions, implemented by the CPU
\end{itemize}
\subsubsection{Memory Barriers}
\label{sec:org8f4b66d}
\begin{itemize}
\item Optimization barrier (user library): \texttt{barrier()} to prevent reordering of
instructions by the compiler
\item Memory barrier (instructions): to prevent read-write reordering
\end{itemize}
\subsubsection{Spin Locks (Active waiting)}
\label{sec:org9f5a8e9}
\begin{enumerate}
\item API
\label{sec:org7a9ee21}
\texttt{spin\_lock()} and \texttt{spin\_unlock()}
\item Ticket Locks
\label{sec:org5bd43f0}
Assumption: there is an atomic \texttt{fetch\_and\_inc(var)} function.
\begin{itemize}
\item entering cs: take a ticket number with fetch and inc. Active waiting when is
not my number
\item exiting cs: increment the now\textsubscript{serving} with \texttt{fetch\_and\_inc(var)}.
\end{itemize}

\item Problem with interrupts
\label{sec:orge51bfdb}
\begin{itemize}
\item What if an interrupt happens when a process holds the spin lock?
\item What if the interrupt handler needs to acess data held by the spin lock holder?
\end{itemize}
\item Solution: disable interrupts while holding spin lock
\label{sec:orgc4e89b0}
\end{enumerate}
\subsubsection{Semaphore}
\label{sec:orgfc70ad1}
\begin{enumerate}
\item Etymology
\label{sec:org3a50cae}
Flags used on ships to communicate
\item Difference compared to spin locks
\label{sec:org98d0113}
\begin{itemize}
\item Contention for the lock causes \textbf{blocking} not \textbf{spinning}.
\item Can allow concurrency of more than 1 process if necessary
\end{itemize}
\item API
\label{sec:org01b51c1}
\begin{itemize}
\item \texttt{down()} or \texttt{P()}: can be blocked, although can either down or try\textsubscript{down}
\item \texttt{up()} or \texttt{V()}
\end{itemize}
\end{enumerate}
\subsubsection{Reader/writer locks}
\label{sec:org7e642f2}
Allows multiple reader or a single writer. Increase efficiency of semaphore
\begin{enumerate}
\item Big reader locks (\texttt{br\_lock})
\label{sec:orgab5daa9}
Specialized form, very fast to acquire for reading but slow for writing. Think
possible starvation for writer?
\end{enumerate}
\subsubsection{Seqlock}
\label{sec:orga26343c}
A reader-writer lock with high priority on writers
\begin{enumerate}
\item How it works
\label{sec:orge825d17}
\begin{enumerate}
\item On top of a spin lock, there is a sequence field
\item The sequence value is incremented when writer uses
\item Readers might need to re-read
\end{enumerate}
\end{enumerate}
\subsubsection{Read-copy Update (RCU)}
\label{sec:org3d9ae39}
\begin{itemize}
\item Lock-free data structure
\item Another R-W lock. Writes are written to a new copy, and writer changes the
pointer to the new copy atomically.
\item Before reading, some time is given (swap to user space, idle loop) to ensure
the new copy is pointed to, hence read.
\end{itemize}
\subsubsection{Completion}
\label{sec:orgd3f1484}
\subsection{Lock-free data structures}
\label{sec:org49dda6e}
\subsubsection{Problem with locks}
\label{sec:orgf101066}
\begin{enumerate}
\item Deadlock
\item Priority inversion
\item Convoying - long thread get the lock, stalling short ones
\item Signal safety
\item Kill-tolerance - what if the holder is killed?
\item Pre-emption tolerance - what if the holder is preempted?
\item Performance - forced sequential operations
\end{enumerate}
\subsubsection{The heart of lock-free data structures - CAS}
\label{sec:org046119f}
\ldots{} is the \texttt{compare\_and\_swap(*ptr, old\_val,  new\_val)} atomic operation.
\subsubsection{An example: lock-free stack}
\label{sec:org988ef53}
\begin{enumerate}
\item Structure
\label{sec:org1f45070}
A (singly) linked list, where head is the top of the stack
\item API
\label{sec:org7052cd2}
\begin{enumerate}
\item push
\label{sec:org01e2afb}
\begin{enumerate}
\item create a linked list node with the new value
\item while \texttt{compare\_and\_swap(head, curr\_node->next, curr\_node)} is false, make the
new node point to the (new) linked list head
\end{enumerate}
\item pop
\label{sec:orgd67da1b}
\end{enumerate}
\item The ABA Problem
\label{sec:orgdefad77}
\begin{enumerate}
\item Say the stack is A -> B -> X
\item P1 reads A from the stack
\item P2 pops A
\item P2 pops B
\item P2 pushes A
\item P1 comes back and compares with the head, which is still A, but the value is
changed (they use the same pointer?)
\end{enumerate}
\begin{enumerate}
\item Solution
\label{sec:org3240b06}
\begin{itemize}
\item Keep an update count for each element. That way the new generation will not be
confused as the previous.
\item Uses the doubleword compare and swap (CAS)
\end{itemize}
\end{enumerate}
\end{enumerate}
\subsubsection{CAS is Insufficient}
\label{sec:org89ac0a8}
Imagine a linked list, P1 tries to delete the 2nd element, P2 tries to insert
between the 2nd and 3rd element. The new list does not the 1st element point to
P2 in one execution (verify this).
\section{Lecture 10: Filesystem}
\label{sec:orgfb22055}
A bookeeping attempt for the array of bits on hard drive.
\subsection{Virtual Filesystem (VFS)}
\label{sec:org21e301c}
\begin{itemize}
\item Known though its APIs: \texttt{open, close, read, write} syscalls
\item Abstracts through different fs: \texttt{ext2, ms-dos} etc
\end{itemize}
\subsubsection{Common File Model}
\label{sec:orgfd35be5}
\begin{itemize}
\item The data structure to represent files
\end{itemize}
\begin{enumerate}
