y3s2/cs5250/cs5250.org
**** Superblock object
- Stores info about a mounted system
- All superblocks are stored in a doubly linked list
- corr. to (filesystem control block)
**** Inode object
- metadata for a file, directory etc
- =ls -i=
- corr. to (file control block)
**** File object
- Only exists in kernel memory, when it is opened.
- Transactonal data between a process (reading/writing it) and the file
- hierachy =task_struct->files_struct->struct file=
**** Dentry object
- Directory entry: links dirs to files
- Is cached since takes long to construct
- Exists because a directory may not exist in the disk, need a common API
*** Everything is a file
filesystems include =usbfs= etc
*** API
- 0th layer: system calls
- 1st layer: =read, write= etc in libc
- 2nd layer: =fread, fwrite= etc work with file objects and have buffering
** Disk filesystems
*** Purpose
- provides structure to data
- provides a logical namespace
- abstract user interface
- security
*** Journaling
- Keeps a "journal" for not-yet-committed changes to files, especially for
  complex filesystems like deleting a file (remove dir entry, release inode,
  move blocks into free pool, bookeeping...)
- Provides points for recovery in case the chain above breaks due to a crash
*** Examples
**** File Allocation Table (FAT)
***** Core Idea
the FAT (the table) points to sectors, which are then linked lists of sectors
forming the file.
**** New Technology File System (NTFS)
** Sysfs - in-memory filesystem
