y3s2/cs5250/cs5250.tex
\item Superblock object
\label{sec:org30d6e51}
\begin{itemize}
\item Stores info about a mounted system
\item All superblocks are stored in a doubly linked list
\item corr. to (filesystem control block)
\end{itemize}
\item Inode object
\label{sec:orge293454}
\begin{itemize}
\item metadata for a file, directory etc
\item \texttt{ls -i}
\item corr. to (file control block)
\end{itemize}
\item File object
\label{sec:orgced6044}
\begin{itemize}
\item Only exists in kernel memory, when it is opened.
\item Transactonal data between a process (reading/writing it) and the file
\item hierachy \texttt{task\_struct->files\_struct->struct file}
\end{itemize}
\item Dentry object
\label{sec:org4765319}
\begin{itemize}
\item Directory entry: links dirs to files
\item Is cached since takes long to construct
\item Exists because a directory may not exist in the disk, need a common API
\end{itemize}
\end{enumerate}
\subsubsection{Everything is a file}
\label{sec:org3d6d4c9}
filesystems include \texttt{usbfs} etc
\subsubsection{API}
\label{sec:orgbbbf9a0}
\begin{itemize}
\item 0th layer: system calls
\item 1st layer: \texttt{read, write} etc in libc
\item 2nd layer: \texttt{fread, fwrite} etc work with file objects and have buffering
\end{itemize}
\subsection{Disk filesystems}
\label{sec:org31c577b}
\subsubsection{Purpose}
\label{sec:org4e217d1}
\begin{itemize}
\item provides structure to data
\item provides a logical namespace
\item abstract user interface
\item security
\end{itemize}
\subsubsection{Journaling}
\label{sec:org8f6bdec}
\begin{itemize}
\item Keeps a ``journal'' for not-yet-committed changes to files, especially for
complex filesystems like deleting a file (remove dir entry, release inode,
move blocks into free pool, bookeeping\ldots{})
\item Provides points for recovery in case the chain above breaks due to a crash
\end{itemize}
\subsubsection{Examples}
\label{sec:orgf7afe80}
\begin{enumerate}
\item File Allocation Table (FAT)
\label{sec:org8a9610e}
\begin{enumerate}
\item Core Idea
\label{sec:orgc0f5e10}
the FAT (the table) points to sectors, which are then linked lists of sectors
forming the file.
\end{enumerate}
\item New Technology File System (NTFS)
\label{sec:org9cc3da6}
\end{enumerate}
\subsection{Sysfs - in-memory filesystem}
\label{sec:org67bbd35}
\end{document}
